:PROPERTIES:
:ID:       8d881c2b-5ce1-4ec9-bce6-fe87cb88e570
:END:
#+title: Vast
#+header-args:sh: :dir ../../

- tags :: [[id:99784b24-5f17-41ed-84eb-f1aa78ab05f9][Tenzir]]

* Vast.yaml


+ namespace: vast-config-<state>
  - prod -> production

#+begin_src sh :async :exports both :results output
std run //tenzir//generator:config-vast-prod
#+end_src

#+RESULTS:


** generating config to nixosModule of the vast

#+begin_src nix :async :exports both :results output
services.vast.settings = inputs.data-merge.merge inputs.cells-lab.tenzir.generator.prod {
  vast.endpoint = "192.168.1.1:4000";
};
#+end_src


** generating config to NomadJobs of the vast

#+begin_src nix :async :exports both :results output
deployNomadJobs.vast.prod = inputs.data-merge.merge inputs.cells.tenzir.generator.prod {
  vast.endpoint = "192.168.1.1:4000";
  # <custom settings>
};
#+end_src

- deploy

#+begin_src sh :async :exports both :results output
std //tenzir//deploy:vast-prod
#+end_src


* dockerComposes

** dev

#+begin_src sh :async :exports both :results output
std //vast/dockerComposes/dev:explore
#+end_src

#+RESULTS:
#+begin_example
services:
  vast:
    environment: {}
    image: tenzir/vast:${VERSION}
    ports:
    - ${VAST_PORT:-42000}:42000
    restart: always
    volumes:
    - vastdata:/var/lib/vast
version: '3'
volumes:
  vastdata: {}
#+end_example

** prod

#+begin_src sh :async :exports both :results output
std //vast/dockerComposes/prod:explore
#+end_src

#+RESULTS:
#+begin_example
services:
  vast:
    environment: {}
    image: tenzir/vast:${VERSION}
    ports:
    - ${VAST_PORT:-42000}:42000
    restart: always
    volumes:
    - vastdata:/var/lib/vast
version: '3'
volumes:
  vastdata: {}
#+end_example

** release

#+begin_src sh :async :exports both :results output
std //vast/dockerComposes/release:explore
#+end_src

#+RESULTS:
#+begin_example
services:
  vast:
    environment: {}
    image: tenzir/vast:v2.3.1
    ports:
    - 42000:42000
    restart: always
    volumes:
    - vastdata:/var/lib/vast
version: '3'
volumes:
  vastdata: {}
#+end_example


* NomadJobs
